package com.example.ff;

import java.util.HashMap;
import java.util.Map;

public class Descriptions {
    public static final Map<String, String> FULL_DESCRIPTIONS = new HashMap<>();

    static {
        FULL_DESCRIPTIONS.put("Йога — гармония тела, разума и души",
                "Йога — не просто фитнес, а комплекс физических упражнений, дыхательных техник и практик концентрации внимания. " +
                        "Это целая философия, древнее учение, а для многих — образ жизни. " +
                        "Йога развивает человека всесторонне — через тело, ум и эмоции, " +
                        "а также помогает достичь гармонии физического и психологического состояния.");

        FULL_DESCRIPTIONS.put("Бег — ритм свободы, силы и вдохновения.",
                "Бег – один из самых эффективных видов кардионагрузки, позволяющий укрепить мышцы и суставы, повысить обмен веществ в организме, улучшить иммунитет. " +
                        "Если длительно и профессионально заниматься бегом, можно значительно улучшить работу нервной и эндокринной систем организма.");

        FULL_DESCRIPTIONS.put("Скакалка — энергия движения, лёгкость и выносливость.",
                "Скакалка — это мощный инструмент для развития выносливости, координации и скорости. Прыжки на скакалке задействуют всё тело, улучшая работу сердечно-сосудистой системы, укрепляя мышцы ног и повышая общую физическую подготовку. " +
                        "Подходит как для разминки, так и для полноценной тренировки.");

        FULL_DESCRIPTIONS.put("Жим лёжа — это сила, контроль и выносливость.",
                "Жим лёжа — Упражнение, развивающее грудные мышцы, плечи и трицепсы, помогает увеличить мощь верхней части тела и улучшить общую физическую подготовку. " +
                        "Это классика силового тренинга, требующая техники, концентрации и упорства для достижения лучших результатов.");
    }
}